# first off terra plan single vm

```bash
bash-5.0$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.eip will be created
  + resource "aws_eip" "eip" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + tags              = {
          + "Env" = "creshdemo"
        }
      + vpc               = true
    }

  # aws_eip_association.eip_assoc will be created
  + resource "aws_eip_association" "eip_assoc" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # aws_instance.creshVM will be created
  + resource "aws_instance" "creshVM" {
      + ami                          = "ami-0ebc281c20e89ba4b"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "creshKeyPair"
      + network_interface_id         = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + security_groups              = [
          + "allow_ssh",
        ]
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Env" = "creshdemo"
        }
      + tenancy                      = (known after apply)
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.allow_all will be created
  + resource "aws_security_group" "allow_all" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "allow_ssh"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_eip.eip: Creating...
aws_security_group.allow_all: Creating...
aws_eip.eip: Creation complete after 0s [id=eipalloc-00b738dd2c21b372d]
aws_security_group.allow_all: Creation complete after 1s [id=sg-07a2279cee5f8a69d]
aws_instance.creshVM: Creating...
aws_instance.creshVM: Still creating... [10s elapsed]
aws_instance.creshVM: Creation complete after 12s [id=i-0ae83d1cf3e7480a6]
aws_eip_association.eip_assoc: Creating...
aws_eip_association.eip_assoc: Creation complete after 0s [id=eipassoc-009381598a2675dba]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

Outputs:

arn = arn:aws:ec2:eu-west-3:794026459452:instance/i-0ae83d1cf3e7480a6
availability_zone = eu-west-3b
credit_specification = [
  {
    "cpu_credits" = "unlimited"
  },
]
ebs_block_device_volume_ids = []
id = i-0ae83d1cf3e7480a6
instance_state = running
ipv6_addresses = []
key_name = creshKeyPair
password_data = 
placement_group = 
primary_network_interface_id = eni-0337ec5fcc7e0b118
private_dns = ip-172-31-25-147.eu-west-3.compute.internal
private_ip = 172.31.25.147
public_dns = ec2-35-180-26-136.eu-west-3.compute.amazonaws.com
public_ip = 35.180.26.136
root_block_device_volume_ids = [
  [
    "vol-09f9aa6515f3743ca",
  ],
]
security_groups = [
  "allow_ssh",
]
subnet_id = subnet-8aa7f3f1
tags = {
  "Env" = "creshdemo"
}
vm_id = i-0ae83d1cf3e7480a6
volume_tags = {}
vpc_security_group_ids = [
  "sg-07a2279cee5f8a69d",
]
bash-5.0$ 
 
```